Sysbench_PolarDB_Mysql5.7-8.0/Sysbench_Mysql5.7_log/8Core64G-1Node/202103101918/sysbench_read_write_4000.log
Time: 20210310194001, now running sysbench with thread of:  + 4000
Running command: sysbench /usr/share/sysbench/oltp_read_write.lua --db-driver=mysql --mysql-host=pc-0iw7xr702y48yl2c1.rwlb.japan.rds.aliyuncs.com --mysql-port=3306 --mysql-user=sbtest --mysql-password=Test1234 --mysql-db=sbtest --table-size=100000000 --tables=500 --events=0 --time=60 --db-ps-mode=disable --percentile=95 --report-interval=1 --threads=4000 run
sysbench 1.0.18-ab7d582 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4000
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 4000 tps: 2.72 qps: 33375.59 (r/w/o: 29662.35/78.04/3635.20) lat (ms,95%): 1069.86 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 4000 tps: 150.09 qps: 12807.58 (r/w/o: 11238.65/1268.75/300.18) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 4000 tps: 441.01 qps: 9519.23 (r/w/o: 6077.15/2560.06/882.02) lat (ms,95%): 3040.14 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 4000 tps: 568.98 qps: 13238.50 (r/w/o: 9355.65/2744.90/1137.96) lat (ms,95%): 3982.86 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 4000 tps: 727.99 qps: 14342.85 (r/w/o: 9378.90/3507.96/1455.98) lat (ms,95%): 5033.35 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 4000 tps: 924.03 qps: 15910.59 (r/w/o: 10971.41/3091.12/1848.07) lat (ms,95%): 6026.41 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 4000 tps: 694.03 qps: 17942.84 (r/w/o: 13591.64/2963.14/1388.06) lat (ms,95%): 6960.17 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 4000 tps: 351.00 qps: 16900.97 (r/w/o: 13581.98/2617.00/702.00) lat (ms,95%): 7754.26 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 4000 tps: 576.98 qps: 12536.51 (r/w/o: 7851.70/3531.86/1152.96) lat (ms,95%): 8795.93 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 4000 tps: 618.98 qps: 14702.64 (r/w/o: 9956.75/3506.91/1238.97) lat (ms,95%): 9624.59 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 4000 tps: 1106.98 qps: 21118.68 (r/w/o: 14243.78/4660.93/2213.97) lat (ms,95%): 10531.32 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 4000 tps: 1085.06 qps: 21719.24 (r/w/o: 15058.86/4491.26/2169.12) lat (ms,95%): 11523.48 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 4000 tps: 1235.93 qps: 23853.71 (r/w/o: 16882.09/4498.76/2472.87) lat (ms,95%): 12384.09 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 4000 tps: 1129.04 qps: 23334.80 (r/w/o: 16358.56/4720.16/2256.08) lat (ms,95%): 9624.59 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 4000 tps: 1169.00 qps: 22997.08 (r/w/o: 16243.06/4421.02/2333.01) lat (ms,95%): 10158.80 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 4000 tps: 1226.00 qps: 24418.96 (r/w/o: 17698.97/4264.99/2455.00) lat (ms,95%): 14047.70 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 4000 tps: 591.00 qps: 12053.02 (r/w/o: 8206.01/2661.00/1186.00) lat (ms,95%): 11115.87 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 4000 tps: 500.04 qps: 11092.81 (r/w/o: 7648.56/2445.18/999.07) lat (ms,95%): 7615.89 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 4000 tps: 588.02 qps: 12010.44 (r/w/o: 8427.31/2401.09/1182.04) lat (ms,95%): 8638.96 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4000 tps: 658.85 qps: 13215.04 (r/w/o: 9232.93/2669.40/1312.71) lat (ms,95%): 9452.83 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 4000 tps: 582.04 qps: 11590.87 (r/w/o: 8146.61/2280.17/1164.09) lat (ms,95%): 10343.39 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 4000 tps: 444.05 qps: 8070.88 (r/w/o: 5384.59/1798.20/888.10) lat (ms,95%): 10531.32 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 4000 tps: 655.94 qps: 12670.80 (r/w/o: 8759.17/2600.75/1310.88) lat (ms,95%): 11732.86 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 4000 tps: 690.04 qps: 15545.93 (r/w/o: 11080.66/3084.18/1381.08) lat (ms,95%): 11732.86 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 4000 tps: 579.02 qps: 11931.33 (r/w/o: 8558.24/2215.06/1158.03) lat (ms,95%): 11732.86 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 4000 tps: 569.95 qps: 11061.08 (r/w/o: 7626.37/2294.81/1139.91) lat (ms,95%): 12838.21 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 4000 tps: 728.03 qps: 14945.59 (r/w/o: 10767.42/2722.11/1456.06) lat (ms,95%): 11732.86 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 4000 tps: 535.95 qps: 12227.94 (r/w/o: 8800.24/2355.80/1071.91) lat (ms,95%): 11317.84 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 4000 tps: 416.04 qps: 8202.77 (r/w/o: 5633.53/1737.16/832.08) lat (ms,95%): 11946.04 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4000 tps: 558.00 qps: 11460.91 (r/w/o: 7905.94/2445.98/1108.99) lat (ms,95%): 11317.84 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 4000 tps: 445.96 qps: 8939.15 (r/w/o: 6354.40/1685.84/898.91) lat (ms,95%): 12384.09 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 4000 tps: 378.01 qps: 7589.28 (r/w/o: 5273.19/1560.06/756.03) lat (ms,95%): 12838.21 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 4000 tps: 435.99 qps: 8678.72 (r/w/o: 6133.80/1672.95/871.97) lat (ms,95%): 13308.98 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 4000 tps: 419.01 qps: 8447.20 (r/w/o: 5866.14/1743.04/838.02) lat (ms,95%): 14047.70 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 4000 tps: 340.00 qps: 6814.09 (r/w/o: 4760.07/1374.02/680.01) lat (ms,95%): 14562.82 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 4000 tps: 554.04 qps: 11205.85 (r/w/o: 7756.59/2341.18/1108.08) lat (ms,95%): 14302.94 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 4000 tps: 600.96 qps: 11882.19 (r/w/o: 8409.43/2270.85/1201.92) lat (ms,95%): 15371.13 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 4000 tps: 635.08 qps: 12492.63 (r/w/o: 8756.14/2473.32/1263.17) lat (ms,95%): 14562.82 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 4000 tps: 432.94 qps: 8790.70 (r/w/o: 6200.08/1717.75/872.87) lat (ms,95%): 15650.42 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4000 tps: 313.01 qps: 6159.23 (r/w/o: 4252.16/1282.05/625.02) lat (ms,95%): 16819.24 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 4000 tps: 436.99 qps: 8713.82 (r/w/o: 6062.87/1781.96/868.98) lat (ms,95%): 17752.80 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 4000 tps: 338.98 qps: 6836.69 (r/w/o: 4805.78/1346.94/683.97) lat (ms,95%): 17435.99 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 4000 tps: 330.04 qps: 6602.85 (r/w/o: 4623.59/1326.17/653.08) lat (ms,95%): 18403.78 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 4000 tps: 328.95 qps: 6752.96 (r/w/o: 4666.28/1421.78/664.90) lat (ms,95%): 19425.29 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 4000 tps: 461.06 qps: 9166.23 (r/w/o: 6478.87/1767.24/920.12) lat (ms,95%): 18403.78 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 4000 tps: 568.99 qps: 11332.75 (r/w/o: 7938.82/2253.95/1139.97) lat (ms,95%): 20137.61 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 4000 tps: 565.96 qps: 11323.12 (r/w/o: 7987.38/2203.83/1131.91) lat (ms,95%): 20876.04 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 4000 tps: 612.08 qps: 12243.63 (r/w/o: 8515.13/2504.33/1224.16) lat (ms,95%): 20137.61 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 4000 tps: 772.89 qps: 15479.76 (r/w/o: 10874.42/3059.56/1545.78) lat (ms,95%): 18738.17 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4000 tps: 758.00 qps: 15140.03 (r/w/o: 10584.02/3040.01/1516.00) lat (ms,95%): 18075.36 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 4000 tps: 505.05 qps: 10162.03 (r/w/o: 7098.72/2053.21/1010.10) lat (ms,95%): 17752.80 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 4000 tps: 301.98 qps: 5990.52 (r/w/o: 4225.66/1160.91/603.95) lat (ms,95%): 23257.82 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 4000 tps: 278.99 qps: 5567.89 (r/w/o: 3900.92/1108.98/557.99) lat (ms,95%): 28352.44 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 4000 tps: 256.01 qps: 5132.27 (r/w/o: 3591.19/1029.05/512.03) lat (ms,95%): 23257.82 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 4000 tps: 362.00 qps: 7227.99 (r/w/o: 5067.99/1436.00/724.00) lat (ms,95%): 27846.48 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 4000 tps: 490.98 qps: 9840.55 (r/w/o: 6868.69/1989.91/981.96) lat (ms,95%): 28352.44 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 4000 tps: 431.01 qps: 8572.14 (r/w/o: 5962.10/1749.03/861.01) lat (ms,95%): 25911.33 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 4000 tps: 312.00 qps: 6265.07 (r/w/o: 4445.05/1195.01/625.01) lat (ms,95%): 27349.55 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 4000 tps: 354.02 qps: 7033.50 (r/w/o: 4921.35/1404.10/708.05) lat (ms,95%): 28867.59 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4000 tps: 314.98 qps: 6309.59 (r/w/o: 4443.71/1235.92/629.96) lat (ms,95%): 30469.90 err/s: 0.00 reconn/s: 0.00
[ 61s ] thds: 4000 tps: 337.99 qps: 6793.89 (r/w/o: 4732.93/1384.98/675.99) lat (ms,95%): 32745.49 err/s: 0.00 reconn/s: 0.00
[ 62s ] thds: 4000 tps: 285.01 qps: 5694.12 (r/w/o: 3990.08/1134.02/570.01) lat (ms,95%): 31023.52 err/s: 0.00 reconn/s: 0.00
[ 63s ] thds: 4000 tps: 404.02 qps: 8097.36 (r/w/o: 5656.25/1633.07/808.04) lat (ms,95%): 32161.14 err/s: 0.00 reconn/s: 0.00
[ 64s ] thds: 4000 tps: 447.00 qps: 8914.92 (r/w/o: 6244.94/1775.98/893.99) lat (ms,95%): 32161.14 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 4000 tps: 374.97 qps: 7473.44 (r/w/o: 5262.60/1460.89/749.94) lat (ms,95%): 35830.44 err/s: 0.00 reconn/s: 0.00
[ 66s ] thds: 4000 tps: 274.03 qps: 5532.64 (r/w/o: 3822.44/1162.14/548.06) lat (ms,95%): 32161.14 err/s: 0.00 reconn/s: 0.00
[ 67s ] thds: 4000 tps: 425.98 qps: 8419.65 (r/w/o: 5945.76/1621.93/851.97) lat (ms,95%): 33946.25 err/s: 0.00 reconn/s: 0.00
[ 68s ] thds: 4000 tps: 358.00 qps: 7207.05 (r/w/o: 5044.03/1447.01/716.00) lat (ms,95%): 37819.22 err/s: 0.00 reconn/s: 0.00
[ 69s ] thds: 4000 tps: 410.02 qps: 8179.40 (r/w/o: 5740.28/1619.08/820.04) lat (ms,95%): 34563.04 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 4000 tps: 290.98 qps: 5811.51 (r/w/o: 4070.66/1158.90/581.95) lat (ms,95%): 35191.04 err/s: 0.00 reconn/s: 0.00
[ 71s ] thds: 4000 tps: 260.99 qps: 5364.88 (r/w/o: 3641.92/1200.97/521.99) lat (ms,95%): 38506.38 err/s: 0.00 reconn/s: 0.00
[ 72s ] thds: 4000 tps: 422.00 qps: 8357.93 (r/w/o: 5919.95/1593.99/843.99) lat (ms,95%): 35830.44 err/s: 0.00 reconn/s: 0.00
[ 73s ] thds: 4000 tps: 242.99 qps: 4832.84 (r/w/o: 3404.89/941.97/485.98) lat (ms,95%): 39206.03 err/s: 0.00 reconn/s: 0.00
[ 74s ] thds: 4000 tps: 353.02 qps: 6968.36 (r/w/o: 4833.25/1429.07/706.04) lat (ms,95%): 35830.44 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 4000 tps: 310.00 qps: 6302.04 (r/w/o: 4449.03/1233.01/620.00) lat (ms,95%): 40643.69 err/s: 0.00 reconn/s: 0.00
[ 76s ] thds: 4000 tps: 317.00 qps: 6238.94 (r/w/o: 4364.96/1239.99/633.99) lat (ms,95%): 42134.07 err/s: 0.00 reconn/s: 0.00
[ 77s ] thds: 4000 tps: 408.00 qps: 8254.04 (r/w/o: 5785.03/1653.01/816.00) lat (ms,95%): 38506.38 err/s: 0.00 reconn/s: 0.00
[ 78s ] thds: 4000 tps: 259.99 qps: 5218.83 (r/w/o: 3625.88/1072.96/519.98) lat (ms,95%): 43679.10 err/s: 0.00 reconn/s: 0.00
[ 79s ] thds: 4000 tps: 414.99 qps: 8247.87 (r/w/o: 5769.91/1647.97/829.99) lat (ms,95%): 38506.38 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 4000 tps: 291.02 qps: 5851.31 (r/w/o: 4112.22/1157.06/582.03) lat (ms,95%): 42899.63 err/s: 0.00 reconn/s: 0.00
[ 81s ] thds: 4000 tps: 370.99 qps: 7408.85 (r/w/o: 5209.89/1456.97/741.98) lat (ms,95%): 41382.17 err/s: 0.00 reconn/s: 0.00
[ 82s ] thds: 4000 tps: 349.99 qps: 7054.83 (r/w/o: 4899.88/1454.97/699.98) lat (ms,95%): 37819.22 err/s: 0.00 reconn/s: 0.00
[ 83s ] thds: 4000 tps: 375.06 qps: 7479.11 (r/w/o: 5211.78/1517.23/750.11) lat (ms,95%): 45280.79 err/s: 0.00 reconn/s: 0.00
[ 84s ] thds: 4000 tps: 357.96 qps: 7178.24 (r/w/o: 5017.47/1444.85/715.92) lat (ms,95%): 43679.10 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 4000 tps: 341.01 qps: 6788.17 (r/w/o: 4769.12/1337.03/682.02) lat (ms,95%): 37144.33 err/s: 0.00 reconn/s: 0.00
[ 86s ] thds: 4000 tps: 299.99 qps: 6042.80 (r/w/o: 4235.86/1206.96/599.98) lat (ms,95%): 42134.07 err/s: 0.00 reconn/s: 0.00
[ 87s ] thds: 4000 tps: 463.00 qps: 9276.00 (r/w/o: 6484.00/1866.00/926.00) lat (ms,95%): 37819.22 err/s: 0.00 reconn/s: 0.00
[ 88s ] thds: 4000 tps: 352.99 qps: 7062.89 (r/w/o: 4941.92/1414.98/705.99) lat (ms,95%): 44472.74 err/s: 0.00 reconn/s: 0.00
[ 89s ] thds: 4000 tps: 393.03 qps: 7816.60 (r/w/o: 5491.42/1539.12/786.06) lat (ms,95%): 42899.63 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 4000 tps: 441.01 qps: 8869.11 (r/w/o: 6185.08/1802.02/882.01) lat (ms,95%): 44472.74 err/s: 0.00 reconn/s: 0.00
[ 91s ] thds: 4000 tps: 316.99 qps: 6300.87 (r/w/o: 4403.91/1262.97/633.99) lat (ms,95%): 46103.52 err/s: 0.00 reconn/s: 0.00
[ 92s ] thds: 4000 tps: 238.00 qps: 4801.99 (r/w/o: 3366.00/960.00/476.00) lat (ms,95%): 44472.74 err/s: 0.00 reconn/s: 0.00
[ 93s ] thds: 4000 tps: 226.00 qps: 4479.01 (r/w/o: 3112.01/915.00/452.00) lat (ms,95%): 42899.63 err/s: 0.00 reconn/s: 0.00
[ 94s ] thds: 4000 tps: 287.00 qps: 5762.07 (r/w/o: 4016.05/1172.01/574.01) lat (ms,95%): 43679.10 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 4000 tps: 323.98 qps: 6489.56 (r/w/o: 4562.69/1278.91/647.96) lat (ms,95%): 46941.21 err/s: 0.00 reconn/s: 0.00
[ 96s ] thds: 4000 tps: 397.01 qps: 7915.28 (r/w/o: 5553.20/1568.06/794.03) lat (ms,95%): 46103.52 err/s: 0.00 reconn/s: 0.00
[ 97s ] thds: 4000 tps: 240.99 qps: 4863.77 (r/w/o: 3389.84/991.95/481.98) lat (ms,95%): 50446.94 err/s: 0.00 reconn/s: 0.00
[ 98s ] thds: 4000 tps: 392.03 qps: 7705.67 (r/w/o: 5351.46/1570.14/784.07) lat (ms,95%): 46103.52 err/s: 0.00 reconn/s: 0.00
[ 99s ] thds: 4000 tps: 326.00 qps: 6641.95 (r/w/o: 4674.97/1314.99/652.00) lat (ms,95%): 49546.69 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 4000 tps: 391.00 qps: 7874.03 (r/w/o: 5516.02/1576.01/782.00) lat (ms,95%): 51363.54 err/s: 0.00 reconn/s: 0.00
[ 101s ] thds: 4000 tps: 382.99 qps: 7561.75 (r/w/o: 5306.83/1490.95/763.98) lat (ms,95%): 52296.79 err/s: 0.00 reconn/s: 0.00
[ 102s ] thds: 4000 tps: 416.00 qps: 8495.98 (r/w/o: 5846.99/1817.00/832.00) lat (ms,95%): 52296.79 err/s: 0.00 reconn/s: 0.00
[ 103s ] thds: 4000 tps: 296.99 qps: 5891.88 (r/w/o: 4166.92/1128.98/595.99) lat (ms,95%): 50446.94 err/s: 0.00 reconn/s: 0.00
[ 104s ] thds: 4000 tps: 383.04 qps: 7605.74 (r/w/o: 5364.52/1475.14/766.07) lat (ms,95%): 50446.94 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 4000 tps: 281.00 qps: 5622.90 (r/w/o: 3952.93/1107.98/561.99) lat (ms,95%): 50446.94 err/s: 0.00 reconn/s: 0.00
[ 106s ] thds: 4000 tps: 371.96 qps: 7427.25 (r/w/o: 5209.48/1473.85/743.93) lat (ms,95%): 51363.54 err/s: 0.00 reconn/s: 0.00
[ 107s ] thds: 4000 tps: 251.03 qps: 5026.52 (r/w/o: 3509.37/1015.11/502.05) lat (ms,95%): 56202.50 err/s: 0.00 reconn/s: 0.00
[ 108s ] thds: 4000 tps: 317.99 qps: 6346.75 (r/w/o: 4456.83/1253.95/635.98) lat (ms,95%): 51363.54 err/s: 0.00 reconn/s: 0.00
[ 109s ] thds: 4000 tps: 291.00 qps: 5815.98 (r/w/o: 4063.99/1170.00/582.00) lat (ms,95%): 47794.11 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 4000 tps: 349.00 qps: 6928.01 (r/w/o: 4888.01/1342.00/698.00) lat (ms,95%): 46941.21 err/s: 0.00 reconn/s: 0.00
[ 111s ] thds: 4000 tps: 334.97 qps: 6738.34 (r/w/o: 4697.54/1370.87/669.93) lat (ms,95%): 57223.68 err/s: 0.00 reconn/s: 0.00
[ 112s ] thds: 4000 tps: 496.07 qps: 9589.30 (r/w/o: 6682.91/1914.26/992.13) lat (ms,95%): 53247.01 err/s: 0.00 reconn/s: 0.00
[ 113s ] thds: 4000 tps: 303.98 qps: 6304.50 (r/w/o: 4486.64/1209.90/607.95) lat (ms,95%): 50446.94 err/s: 0.00 reconn/s: 0.00
[ 114s ] thds: 4000 tps: 361.01 qps: 7253.29 (r/w/o: 5084.20/1447.06/722.03) lat (ms,95%): 49546.69 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 4000 tps: 311.01 qps: 6188.16 (r/w/o: 4367.11/1198.03/623.02) lat (ms,95%): 50446.94 err/s: 1.00 reconn/s: 0.00
[ 116s ] thds: 4000 tps: 364.98 qps: 7324.69 (r/w/o: 5085.78/1508.94/729.97) lat (ms,95%): 51363.54 err/s: 0.00 reconn/s: 0.00
[ 117s ] thds: 4000 tps: 385.00 qps: 7687.93 (r/w/o: 5415.95/1501.99/769.99) lat (ms,95%): 52296.79 err/s: 0.00 reconn/s: 0.00
[ 118s ] thds: 4000 tps: 269.99 qps: 5471.87 (r/w/o: 3769.91/1161.97/539.99) lat (ms,95%): 56202.50 err/s: 0.00 reconn/s: 0.00
[ 119s ] thds: 4000 tps: 283.01 qps: 5615.24 (r/w/o: 3972.17/1077.05/566.02) lat (ms,95%): 54214.49 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 4000 tps: 305.91 qps: 5663.36 (r/w/o: 3848.88/1233.64/580.83) lat (ms,95%): 48662.51 err/s: 0.00 reconn/s: 0.00
[ 121s ] thds: 4000 tps: 234.05 qps: 900.19 (r/w/o: 0.00/666.14/234.05) lat (ms,95%): 61497.34 err/s: 0.00 reconn/s: 0.00
[ 122s ] thds: 3999 tps: 164.99 qps: 584.96 (r/w/o: 0.00/419.97/164.99) lat (ms,95%): 71026.01 err/s: 0.00 reconn/s: 0.00
[ 123s ] thds: 3999 tps: 137.00 qps: 505.00 (r/w/o: 0.00/368.00/137.00) lat (ms,95%): 60399.89 err/s: 0.00 reconn/s: 0.00
[ 124s ] thds: 3999 tps: 199.01 qps: 715.04 (r/w/o: 0.00/516.03/199.01) lat (ms,95%): 66090.17 err/s: 0.00 reconn/s: 0.00
[ 125s ] thds: 3999 tps: 161.00 qps: 599.01 (r/w/o: 0.00/438.00/161.00) lat (ms,95%): 63752.41 err/s: 0.00 reconn/s: 0.00
[ 126s ] thds: 3999 tps: 219.00 qps: 801.00 (r/w/o: 0.00/582.00/219.00) lat (ms,95%): 62614.72 err/s: 0.00 reconn/s: 0.00
[ 127s ] thds: 3999 tps: 183.01 qps: 660.03 (r/w/o: 0.00/477.02/183.01) lat (ms,95%): 64910.76 err/s: 0.00 reconn/s: 0.00
[ 128s ] thds: 3999 tps: 227.99 qps: 797.98 (r/w/o: 0.00/569.98/227.99) lat (ms,95%): 72316.52 err/s: 0.00 reconn/s: 0.00
[ 129s ] thds: 3999 tps: 185.01 qps: 677.05 (r/w/o: 0.00/492.04/185.01) lat (ms,95%): 67291.00 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 3999 tps: 246.98 qps: 901.93 (r/w/o: 0.00/654.95/246.98) lat (ms,95%): 71026.01 err/s: 0.00 reconn/s: 0.00
[ 131s ] thds: 3999 tps: 302.98 qps: 1013.94 (r/w/o: 0.00/710.96/302.98) lat (ms,95%): 79129.46 err/s: 0.00 reconn/s: 0.00
[ 132s ] thds: 3999 tps: 257.01 qps: 952.04 (r/w/o: 0.00/695.03/257.01) lat (ms,95%): 68513.65 err/s: 0.00 reconn/s: 0.00
[ 133s ] thds: 3995 tps: 326.99 qps: 1159.97 (r/w/o: 0.00/832.98/326.99) lat (ms,95%): 61497.34 err/s: 0.00 reconn/s: 0.00
[ 134s ] thds: 3993 tps: 609.93 qps: 2040.76 (r/w/o: 0.00/1430.83/609.93) lat (ms,95%): 67291.00 err/s: 0.00 reconn/s: 0.00
[ 135s ] thds: 3992 tps: 488.04 qps: 1387.12 (r/w/o: 0.00/898.08/489.04) lat (ms,95%): 67291.00 err/s: 0.00 reconn/s: 0.00
[ 136s ] thds: 3929 tps: 25.00 qps: 76.00 (r/w/o: 0.00/52.00/24.00) lat (ms,95%): 77717.37 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            811160
        write:                           231756
        other:                           115879
        total:                           1158795
    transactions:                        57939  (425.42 per sec.)
    queries:                             1158795 (8508.50 per sec.)
    ignored errors:                      1      (0.01 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          136.1901s
    total number of events:              57939

Latency (ms):
         min:                                   11.85
         avg:                                 8907.96
         max:                               111087.90
         95th percentile:                    36481.47
         sum:                            516118106.62

Threads fairness:
    events (avg/stddev):           14.4848/4.67
    execution time (avg/stddev):   129.0295/4.54